'''
Дано натуральное число. Выведите его последнюю цифру.
'''

num = input()

print(int(num[-1]))
