'''
Дано двузначное число. Найдите число десятков в нем
'''
num = int(input())
num1 = num % 100

print(num1 // 10)
