'''
Напишите программу, которая считывает два целых числа A и B и
выводит наибольшее значение из них. Числа — целые от 1 до 1000.
'''
num1 = int(input())
num2 = int(input())

if num1 > num2:
    print(num1)
else:
    print(num2)
